Autodesk.Revit.DB.ExtrusionAnalyzer.Create(Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.Plane,Autodesk.Revit.DB.XYZ)
Creates an ExtrusionAnalyzer and computes and stores the Solid's shadow.
solidGeometry:
The Solid to analyze.
plane:
The plane to use for the base plane for the extrusion.
direction:
The direction to use for the calculation for the extrusion.
The direction must be transverse to the base plane.
Returns:
The newly created ExtrusionAnalyzer object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input direction must be transverse to the input plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
A failure occurred in creating the ExtrusionAnalyzer or computing the Solid's shadow.
Since:
2012

Autodesk.Revit.DB.ExtrusionAnalyzer
This geometry utility allows you to attempt to "fit" a given piece of solid geometry into
the shape of an extrusion.
Remarks:
An instance of this class is a single-time use class which should be provided a
solid geometry, a plane, and a direction.  The utility will calculate a base boundary
parallel to the input plane which is the outer boundary of the shadow cast by the
Solid onto the input plane and along the extrusion direction.
After the extrusion has been calculated, the class permits a second step
analysis to identify all faces from the original geometry which do not align with the
faces of the calculated extrusion.
This utility works best for a Solid that is at least somewhat "extrusion-like",
for example, the geometry of a wall which may or may not be affected by end joins,
floor joins, roof joins, openings cut by windows and doors, or other
modifications.
The ExtrusionAnalyzer expects only one single extrusion-like solid geometry.
The ExtrusionAnalyzer does not support a Solid containing multiple distinguishable "lumps" of geometry
and may give unexpected results in such cases.
In such cases, consider splitting the Solid into its individual connected commponent using
Autodesk::Revit::DB::SolidUtils::SplitVolumes before performing an extrusion analysis.
Since:
2012